In [147]:
import numpy as np
import pandas as pd

In [148]:
date = pd.read_csv('orders.csv')
time = pd.read_csv('messages.csv')

In [149]:
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [150]:
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [151]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [152]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

## Working with Dates

In [153]:
date['date'] = pd.to_datetime(date['date'])

In [154]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

#### 1. Extract year

In [155]:
date['date_year'] = date['date'].dt.year
date.head()

        date  product_id  city_id  orders  date_year
0 2019-12-10        5628       25       3       2019
1 2018-08-15        3646       14     157       2018
2 2018-10-23        1859       25       1       2018
3 2019-08-17        7292       25       1       2019
4 2019-01-06        4344       25       3       2019

#### 1. Extract Month

In [156]:
date['date_month'] = date['date'].dt.month
date.head()

        date  product_id  city_id  orders  date_year  date_month
0 2019-12-10        5628       25       3       2019          12
1 2018-08-15        3646       14     157       2018           8
2 2018-10-23        1859       25       1       2018          10
3 2019-08-17        7292       25       1       2019           8
4 2019-01-06        4344       25       3       2019           1

In [157]:
date['date_month_name'] = date['date'].dt.month_name()
date.head()

,date,product_id,city_id,orders,date_year,date_month,date_month_name
0,2019-12-10,5628,25,3,2019,12,December
1,2018-08-15,3646,14,157,2018,8,August
2,2018-10-23,1859,25,1,2018,10,October
3,2019-08-17,7292,25,1,2019,8,August
4,2019-01-06,4344,25,3,2019,1,January

#### 1. Extract Day

In [158]:
date['date_day'] = date['date'].dt.day
date.drop(columns=['product_id','city_id','orders']).head()

        date  date_year  date_month date_month_name  date_day
0 2019-12-10       2019          12        December        10
1 2018-08-15       2018           8          August        15
2 2018-10-23       2018          10         October        23
3 2019-08-17       2019           8          August        17
4 2019-01-06       2019           1         January         6

In [159]:
date['date_day_name'] = date['date'].dt.day_name()
date.drop(columns=['product_id','city_id','orders']).head()

        date  date_year  date_month date_month_name  date_day date_day_name
0 2019-12-10       2019          12        December        10       Tuesday
1 2018-08-15       2018           8          August        15     Wednesday
2 2018-10-23       2018          10         October        23       Tuesday
3 2019-08-17       2019           8          August        17      Saturday
4 2019-01-06       2019           1         January         6        Sunday

In [160]:
# day of week
date['date_dow'] = date['date'].dt.day_of_week
date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_month,date_month_name,date_day,date_day_name,date_dow
0,2019-12-10,2019,12,December,10,Tuesday,1
1,2018-08-15,2018,8,August,15,Wednesday,2
2,2018-10-23,2018,10,October,23,Tuesday,1
3,2019-08-17,2019,8,August,17,Saturday,5
4,2019-01-06,2019,1,January,6,Sunday,6

In [161]:
# is weekend?

date['date_is_weekend'] = np.where(date['date_day_name'].isin(['Sunday','Saturday']),'yes','no')
date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_month,date_month_name,date_day,date_day_name,date_dow,date_is_weekend
0,2019-12-10,2019,12,December,10,Tuesday,1,no
1,2018-08-15,2018,8,August,15,Wednesday,2,no
2,2018-10-23,2018,10,October,23,Tuesday,1,no
3,2019-08-17,2019,8,August,17,Saturday,5,yes
4,2019-01-06,2019,1,January,6,Sunday,6,yes

#### Extract week of the year

In [162]:
date['date_week'] = date['date'].dt.isocalendar().week

date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_month,date_month_name,date_day,date_day_name,date_dow,date_is_weekend,date_week
0,2019-12-10,2019,12,December,10,Tuesday,1,no,50
1,2018-08-15,2018,8,August,15,Wednesday,2,no,33
2,2018-10-23,2018,10,October,23,Tuesday,1,no,43
3,2019-08-17,2019,8,August,17,Saturday,5,yes,33
4,2019-01-06,2019,1,January,6,Sunday,6,yes,1

#### Extract Quarter

In [163]:
date['quarter'] = date['date'].dt.quarter

date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_month,date_month_name,date_day,date_day_name,date_dow,date_is_weekend,date_week,quarter
0,2019-12-10,2019,12,December,10,Tuesday,1,no,50,4
1,2018-08-15,2018,8,August,15,Wednesday,2,no,33,3
2,2018-10-23,2018,10,October,23,Tuesday,1,no,43,4
3,2019-08-17,2019,8,August,17,Saturday,5,yes,33,3
4,2019-01-06,2019,1,January,6,Sunday,6,yes,1,1

#### Extract Semester

In [164]:
date['semester'] = np.where(date['quarter'].isin([1,2]),1,2)

date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_month,date_month_name,date_day,date_day_name,date_dow,date_is_weekend,date_week,quarter,semester
0,2019-12-10,2019,12,December,10,Tuesday,1,no,50,4,2
1,2018-08-15,2018,8,August,15,Wednesday,2,no,33,3,2
2,2018-10-23,2018,10,October,23,Tuesday,1,no,43,4,2
3,2019-08-17,2019,8,August,17,Saturday,5,yes,33,3,2
4,2019-01-06,2019,1,January,6,Sunday,6,yes,1,1,1

### Extract Time elapsed between dates

In [165]:
import datetime

today = datetime.datetime.today()
today

datetime.datetime(2026, 1, 9, 15, 16, 42, 573365)

In [166]:
today - date['date']

0     2222 days 15:16:42.573365
1     2704 days 15:16:42.573365
2     2635 days 15:16:42.573365
3     2337 days 15:16:42.573365
4     2560 days 15:16:42.573365
                 ...
995   2650 days 15:16:42.573365
996   2591 days 15:16:42.573365
997   2439 days 15:16:42.573365
998   2504 days 15:16:42.573365
999   2278 days 15:16:42.573365
Name: date, Length: 1000, dtype: timedelta64[ns]

In [167]:
(today - date['date']).dt.days

0      2222
1      2704
2      2635
3      2337
4      2560
       ...
995    2650
996    2591
997    2439
998    2504
999    2278
Name: date, Length: 1000, dtype: int64

In [168]:
# Days passed
np.round((today - date['date'])/np.timedelta64(1,'W'),0)
# Days (D)	
# Weeks (W)	
# Hours (h)	
# Seconds (s)

0      318.0
1      386.0
2      377.0
3      334.0
4      366.0
       ...
995    379.0
996    370.0
997    349.0
998    358.0
999    326.0
Name: date, Length: 1000, dtype: float64

In [169]:
# months_passed = np.round((today - date['date']) / np.timedelta64(1, 'D') / 30, 0)
months_passed = (
    (today.year - date['date'].dt.year) * 12 +
    (today.month - date['date'].dt.month)
)
months_passed

0      73
1      89
2      87
3      77
4      84
       ..
995    87
996    85
997    80
998    82
999    75
Name: date, Length: 1000, dtype: int32

In [170]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [171]:
# Converting to datetime datatype
time['date'] = pd.to_datetime(time['date'])

In [172]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [173]:
time['hour'] = time['date'].dt.hour
time['min'] = time['date'].dt.minute
time['sec'] = time['date'].dt.second
time.head()

,date,msg,hour,min,sec
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0

#### Extract Time part

In [174]:
time['time'] = time['date'].dt.time
time.head()

,date,msg,hour,min,sec,time
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0,00:50:00
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0,23:40:00
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0,00:21:00
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0,00:31:00
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0,23:11:00

#### Time difference

In [175]:
today - time['date']

0     4408 days 14:26:42.573365
1     4272 days 15:36:42.573365
2     4758 days 14:55:42.573365
3     4060 days 14:45:42.573365
4     4457 days 16:05:42.573365
                 ...
995   5047 days 14:26:42.573365
996   4368 days 16:02:42.573365
997   4833 days 15:39:42.573365
998   4949 days 15:42:42.573365
999   4221 days 15:51:42.573365
Name: date, Length: 1000, dtype: timedelta64[ns]

In [176]:
# in seconds

(today - time['date'])/np.timedelta64(1,'s')

0      3.809032e+08
1      3.691570e+08
2      4.111449e+08
3      3.508371e+08
4      3.851427e+08
           ...
995    4.361128e+08
996    3.774530e+08
997    4.176276e+08
998    4.276502e+08
999    3.647515e+08
Name: date, Length: 1000, dtype: float64

In [177]:
# in minutes

(today - time['date'])/np.timedelta64(1,'m')

0      6.348387e+06
1      6.152617e+06
2      6.852416e+06
3      5.847286e+06
4      6.419046e+06
           ...
995    7.268547e+06
996    6.290883e+06
997    6.960460e+06
998    7.127503e+06
999    6.079192e+06
Name: date, Length: 1000, dtype: float64

In [178]:
# in hours

(today - time['date'])/np.timedelta64(1,'h')

0      105806.445159
1      102543.611826
2      114206.928493
3       97454.761826
4      106984.095159
           ...
995    121142.445159
996    104848.045159
997    116007.661826
998    118791.711826
999    101319.861826
Name: date, Length: 1000, dtype: float64